﻿﻿﻿﻿//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************
//<AMI_FHDR_START>
//
// Name: CRB.UNI
//
// Description: Chipset Reference Board setup string definitions 
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

#string STR_SMC_CPLDWDT				#language eng "CPLD Watch Dog"
#string STR_SMC_CPLDWDT_HELP			#language eng "Power On: BIOS start the watch dog at very early POST and never stop it.\nPOST: BIOS start the watch dog at very early POST and stop it at the end of POST.\nOS: BIOS start the watch dog when ready to boot OS."
#string STR_SMC_CPLDWDT_SECOND			#language eng " Watch Dog Timer"
#string STR_SMC_CPLDWDT_SECOND_HELP		#language eng "The range is from 1 second to 2048 seconds"
#string STR_SMC_CPLDWDT_POWERON			#language eng "Power On"
#string STR_SMC_CPLDWDT_POST			#language eng "POST"
#string STR_SMC_CPLDWDT_OS			#language eng "OS"

#string STR_SMC_CPLD_ADR			#language eng " CPLD ADR"
#string STR_SMC_CPLD_ADR_HELP			#language eng "CPLD ADR"

#string STR_SMC_CPLD_WDT_NMI_RESET		#language eng " Watch Dog Action"
#string STR_SMC_CPLD_WDT_NMI_RESET_HELP		#language eng "Action of watchdog timeout.\nTigger Reset or NMI."
#string STR_WDT_RESET_STRING			#language eng "Reset"
#string STR_WDT_NMI_STRING			#language eng "NMI"

#string STR_THROTTLE_ON_POWERFAIL               #language eng "Throttle on Power Fail"
#string STR_THROTTLE_ON_POWERFAIL_HELP          #language eng "To descrease system power by throttling CPU frequency when one power supply is failed"


//#string <string name>                 #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
